In [ ]:
import pandas as pd

In [ ]:
df = pd.read_excel (r'/content/pos.xlsx')

In [ ]:
df.head()

   partner_id  RetainedMONTHS       FUSE  ... M1_Retained FIRSTUseDAYS FIRST_TRX
0          16               3 2019-09-06  ...         Yes            1         1
1          28               3 2019-09-04  ...         Yes            1         1
2          33               2 2019-06-25  ...          No            1         5
3          89               2 2020-01-14  ...          No            1         2
4          98              10 2019-05-21  ...         Yes            1         1

[5 rows x 8 columns]

In [ ]:
next_month_retained_df = df.copy()

In [ ]:
next_month_retained_df.head()

   partner_id  RetainedMONTHS       FUSE  ... M1_Retained FIRSTUseDAYS FIRST_TRX
0          16               3 2019-09-06  ...         Yes            1         1
1          28               3 2019-09-04  ...         Yes            1         1
2          33               2 2019-06-25  ...          No            1         5
3          89               2 2020-01-14  ...          No            1         2
4          98              10 2019-05-21  ...         Yes            1         1

[5 rows x 8 columns]

In [ ]:
next_month_retained_df=next_month_retained_df.drop(['FUSE','NextMONTHUSE'],
  axis=1)

In [ ]:
next_month_retained_df.head()

   partner_id  RetainedMONTHS PaidUSER M1_Retained  FIRSTUseDAYS  FIRST_TRX
0          16               3      Yes         Yes             1          1
1          28               3      Yes         Yes             1          1
2          33               2       No          No             1          5
3          89               2       No          No             1          2
4          98              10      Yes         Yes             1          1

In [ ]:
next_month_retained_df.columns

Index(['partner_id', 'RetainedMONTHS', 'PaidUSER', 'M1_Retained',
       'FIRSTUseDAYS', 'FIRST_TRX'],
      dtype='object')

In [ ]:
next_month_retained_df = next_month_retained_df.loc[next_month_retained_df['M1_Retained']=="Yes"]

In [ ]:
next_month_retained_df.head()

   partner_id  RetainedMONTHS PaidUSER M1_Retained  FIRSTUseDAYS  FIRST_TRX
0          16               3      Yes         Yes             1          1
1          28               3      Yes         Yes             1          1
4          98              10      Yes         Yes             1          1
5         171               3      Yes         Yes             1          1
6         181              13      Yes         Yes             1          2

In [ ]:
next_month_retained_df.query('M1_Retained == "Yes" and partner_id == 664497')

      partner_id  RetainedMONTHS PaidUSER M1_Retained  FIRSTUseDAYS  FIRST_TRX
8887      664497               5       No         Yes             8         15

In [ ]:
paid_no_df = next_month_retained_df.copy()

In [ ]:
next_month_retained_df.describe()

          partner_id  RetainedMONTHS  FIRSTUseDAYS     FIRST_TRX
count    3175.000000     3175.000000   3175.000000   3175.000000
mean   322362.069291        4.004724      5.533228     49.963465
std    212715.617002        2.899869      6.039104    292.642249
min        16.000000        2.000000      1.000000      1.000000
25%    154873.500000        2.000000      1.000000      2.000000
50%    255866.000000        3.000000      3.000000      7.000000
75%    458143.500000        5.000000      8.000000     30.000000
max    893765.000000       22.000000     30.000000  10646.000000

In [ ]:
df_topup = pd.read_excel (r'/content/topup.xlsx')

In [ ]:
next_month_topup_retained_df = df_topup.copy()

In [ ]:
next_month_topup_retained_df.head()

   partner_id  RetainedMONTHS       FUSE  ... M1_Retained FIRSTUseDAYS FIRST_TRX
0           2               4 2019-04-02  ...         Yes            5         6
1           3               9 2018-12-19  ...         Yes            3         3
2           9              11 2019-01-13  ...         Yes           11        15
3          28              18 2019-01-03  ...          No            3         3
4          98               1 2020-10-04  ...          No            2         3

[5 rows x 8 columns]

In [ ]:
next_month_topup_retained_df=next_month_topup_retained_df.drop(['FUSE','NextMONTHUSE'],
  axis=1)

In [ ]:
next_month_topup_retained_df = next_month_topup_retained_df.loc[next_month_topup_retained_df['M1_Retained']=="Yes"]

In [ ]:
topup_paid_no_df = next_month_topup_retained_df.copy()
topup_paid_yes_df = next_month_topup_retained_df.copy()

In [ ]:
topup_paid_no_df = topup_paid_no_df.loc[topup_paid_no_df['PaidUSER']=="No"]
topup_paid_yes_df = topup_paid_yes_df.loc[topup_paid_yes_df['PaidUSER']=="Yes"]

In [ ]:
next_month_topup_retained_df.describe()

          partner_id  RetainedMONTHS  FIRSTUseDAYS    FIRST_TRX
count    3994.000000     3994.000000   3994.000000  3994.000000
mean   436800.919629        4.341512      9.054582    59.353781
std    227490.336242        2.218932      7.224983   109.777768
min         2.000000        1.000000      1.000000     1.000000
25%    254641.000000        3.000000      3.000000     6.000000
50%    439026.500000        4.000000      7.000000    18.000000
75%    614500.250000        6.000000     14.000000    64.000000
max    891559.000000       21.000000     31.000000  1271.000000

In [ ]:
df_payment_link = pd.read_excel (r'/content/payment_link.xlsx')

In [ ]:
next_month_payment_link_retained_df = df_payment_link.copy()

In [ ]:
next_month_payment_link_retained_df=next_month_payment_link_retained_df.drop(['FUSE','NextMONTHUSE', 'TRXID'],
  axis=1)

In [ ]:
next_month_payment_link_retained_df.head()

   partner_id  RetainedMONTHS PaidUSER M1_Retained  FIRSTUseDAYS  FIRST_TRX
0          78               2      Yes          No            10         31
1         181               5      Yes         Yes            29        219
2         233               2      Yes         Yes            31        584
3         277               4      Yes         Yes            31        384
4         280               1      Yes         Yes             5         24

In [ ]:
next_month_payment_link_retained_df = next_month_payment_link_retained_df.loc[next_month_payment_link_retained_df['M1_Retained']=="Yes"]

In [ ]:
payment_link_paid_no_df = next_month_payment_link_retained_df.copy()
payment_link_paid_yes_df = next_month_payment_link_retained_df.copy()

In [ ]:
payment_link_paid_no_df = payment_link_paid_no_df.loc[payment_link_paid_no_df['PaidUSER']=="No"]
payment_link_paid_yes_df = payment_link_paid_yes_df.loc[payment_link_paid_yes_df['PaidUSER']=="Yes"]

In [ ]:
next_month_payment_link_retained_df.describe()

          partner_id  RetainedMONTHS  FIRSTUseDAYS    FIRST_TRX
count     869.000000      869.000000    869.000000   869.000000
mean   354288.486766        1.858458     10.014960    76.956272
std    224160.238419        1.439082      8.520158   151.273581
min       181.000000        1.000000      1.000000     2.000000
25%    166501.000000        1.000000      3.000000     8.000000
50%    310133.000000        1.000000      7.000000    22.000000
75%    514734.000000        2.000000     15.000000    67.000000
max    892286.000000       13.000000     31.000000  1279.000000

In [ ]:
df_emi_link = pd.read_excel (r'/content/emi.xlsx')

In [ ]:
next_month_emi_retained_df = df_emi_link.copy()

In [ ]:
next_month_emi_retained_df=next_month_emi_retained_df.drop(['FUSE','NextMONTHUSE', 'TRXID'],
  axis=1)

In [ ]:
next_month_emi_retained_df = next_month_emi_retained_df.loc[next_month_emi_retained_df['M1_Retained']=="Yes"]

In [ ]:
next_month_emi_retained_df.head()

   partner_id  RetainedMONTHS PaidUSER M1_Retained  FIRSTUseDAYS  FIRST_TRX
1        1252               2      Yes         Yes             2          4
4       16572               5      Yes         Yes             4         10
6       19496               2      Yes         Yes             7         21
7       19504               2      Yes         Yes            18         81
8       19534               6      Yes         Yes             5         10

In [ ]:
emi_paid_no_df = next_month_emi_retained_df.copy()
emi_paid_yes_df = next_month_emi_retained_df.copy()

In [ ]:
emi_paid_no_df = emi_paid_no_df.loc[emi_paid_no_df['PaidUSER']=="No"]
emi_paid_yes_df = emi_paid_yes_df.loc[emi_paid_yes_df['PaidUSER']=="Yes"]

In [ ]:
emi_paid_no_df.head()

Empty DataFrame
Columns: [partner_id, RetainedMONTHS, PaidUSER, M1_Retained, FIRSTUseDAYS, FIRST_TRX]
Index: []

In [ ]:
next_month_emi_retained_df.describe()

          partner_id  RetainedMONTHS  FIRSTUseDAYS   FIRST_TRX
count     227.000000      227.000000    227.000000  227.000000
mean   442888.286344        3.643172      4.859031   13.537445
std    229422.386355        1.953097      3.596636   37.404535
min      1252.000000        1.000000      1.000000    3.000000
25%    282261.000000        2.000000      2.000000    6.000000
50%    470325.000000        3.000000      4.000000    8.000000
75%    619421.000000        5.000000      6.000000   14.000000
max    878719.000000       10.000000     26.000000  551.000000

In [ ]:
df_due_tracker_link = pd.read_excel (r'/content/due_racker.xlsx')

In [ ]:
next_month_due_tracker_retained_df = df_due_tracker_link.copy()

In [ ]:
next_month_due_tracker_retained_df.head()

   partner_id  RetainedMONTHS       FUSE  ... M1_Retained FIRSTUseDAYS FIRST_TRX
0           9               2 2020-12-13  ...         Yes            5        21
1         233               9 2020-07-09  ...         Yes           13        41
2         277               1 2020-09-17  ...         Yes            2        10
3         360               1 2020-06-22  ...          No            1        16
4        1067               4 2020-06-16  ...         Yes            8        35

[5 rows x 8 columns]

In [ ]:
next_month_due_tracker_retained_df=next_month_due_tracker_retained_df.drop(['FUSE','NextMONTHUSE'],
  axis=1)

In [ ]:
next_month_due_tracker_retained_df = next_month_due_tracker_retained_df.loc[next_month_due_tracker_retained_df['M1_Retained']=="Yes"]

In [ ]:
next_month_due_tracker_retained_df.describe()

          partner_id  RetainedMONTHS  FIRSTUseDAYS    FIRST_TRX
count    9626.000000      9626.00000   9626.000000  9626.000000
mean   360989.535944         4.24974      8.945045    96.447122
std    203272.347642         3.05893      7.104971   165.703013
min         9.000000         1.00000      1.000000     1.000000
25%    203737.750000         2.00000      3.000000    14.000000
50%    293184.000000         3.00000      7.000000    42.000000
75%    502399.000000         5.00000     14.000000   113.000000
max    897201.000000        14.00000     31.000000  4035.000000